file/rails/app/controllers/projects_controller.rb

    def create
        @project = Project.new(project_params)
        if @project.save
---
INSERT INTO "projects" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "p2"], ["created_at", "2016-05-13 21:27:45.991525"], ["updated_at", "2016-05-13 21:27:45.991525"]]

    def update
        if @project.update(project_params)
---
UPDATE "projects" SET "title" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["title", "22222"], ["updated_at", "2016-05-13 21:58:41.942400"], ["id", 1]]