file/rails/app/controllers/tasks_controller.rb

  def create
      @project = Project.find(params[:project_id])
      @task = @project.tasks.create(task_params)
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "tasks" ("title", "project_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "t1"], ["project_id", 1], ["created_at", "2016-05-16 22:30:33.571199"], ["updated_at", "2016-05-16 22:30:33.571199"]]